# ملف: cmd_fun.py
import telebot

COMMANDS = ["تسلية", "تسلّي"]

def handle(bot, message):
    if message.text not in COMMANDS:
        return

    user_name = message.from_user.first_name

    fun_text = f"""
╔═════════════════╗
      الأوامر الإمبراطورية - تسلية
╚═════════════════╝

مرحباً بك يا {user_name} 👑
━━━━━━━━━━━━━━━

︙أوامر التسلية كالاتي:
—————————————
⌔︙الامر ، تفعيل ، تعطيل ←{{ الامر }}
⌔︙غنيلي ، ريمكس ، اغنيه ، شعر
⌔︙قصيده ، صوره ، متحركه ، ميوزك
⌔︙انمي ، ميمز ، ستوري
⌔︙مسلسل ، فلم
⌔︙حساب العمر( احسب + تاريخ الميلاد)
⌔︙معنى اسم + الاسم
⌔︙اقتباس ، اذكار 
⌔︙تفعيل تعطيل _ اقتباس ، الاذكار 
⌔︙وظيفته (اذكار و اقتباس رد تلقائي كل 1 ساعه)
—————————————
⌔︙تفعيل تعطيل عيد ميلاد
⌔︙اضف ، مسح عيد ميلاد
⌔︙عيد ميلاد ، قائمه الاعياد 
⌔︙مسح قائمه الاعياد
⌔︙وظيفته ( رد تلقائي تهاني عيد ميلاد مع صورة المستخدم كل 5 دقيقه)
—————————————
⌔︙زواج ~ طلاق ← {{بالرد ، بالمعرف}}
⌔︙جاوبه ← {{ بالرد ، بالمعرف }}
⌔︙وظيفته :( يجاوب الشخص بصمه ميمز )
⌔︙المتزوجين ~ مسح المتزوجين
⌔︙ثنائي اليوم ، منشن
⌔︙زوجني ، عقاب ، نكات ، قصص
⌔︙اكتموه {{ بالرد }}
—————————————
⌔︙تفعيل تعطيل الاتي :
⌔︙زواج ، جاوبه ، ثنائي اليوم ، منشن
⌔︙عقاب ، اكتموه ، زوجني
⌔︙نكات ، قصص
—————————————
"""

    bot.reply_to(message, fun_text)
