# ملف: cmd_games_list.py
import telebot

COMMANDS = ["العاب", "الالعاب", "لعبات"]

def handle(bot, message):
    if message.text not in COMMANDS:
        return

    user_name = message.from_user.first_name

    games_text = f"""
╔═════════════════╗
    الألعاب الإمبراطورية
╚═════════════════╝

مرحباً بك يا {user_name} 👑
━━━━━━━━━━━━━━━

⌔︙قائمــة الألعاب الإمبراطورية:
—————————————
🎲 نرد » لعبة رمي النرد الإمبراطوري
🎰 روليت » لعبة الروليت الإمبراطوري
🧩 المختلف » لعبة المختلف
📝 امثله » لعبة الأمثلة
🔄 العكس « لعبة عكس الكلمة
❓ حزوره « لعبة الحزورة
📚 معاني » لعبة المعاني
🎮 بات » لعبة البات
🕵️ خمن » لعبة التخمين
🔡 ترتيب » لعبة ترتيب الحروف
😃 سمايلات » لعبة السمايلات
❔ اسئله » أسئلة منوعة
💬 اسالني » أسئلة عامة متجددة
🧠 لغز » الغاز الذكاء متجددة
➗ رياضيات » مسائل رياضية
🗣️ انكليزي » معاني الكلمات
🐦 كت تويت ، كت » أسئلة ترفيهية
🔀 لو خيروك » لعبة لو خيروك
😎 صراحه » لعبة الصراحة
🌍 اعلام » لعبة اعلام الدول
📰 مقالات » لعبة المقالات
🏛️ عواصم » لعبة عواصم الدول
✍️ كلمات » لعبة كتابة الكلمات
🎲 الحظ » لعبة الحظ الشفافة
💰 حظي » لعبة ربح أو خسارة
🎵 اغاني » لعبة اسم الفنان
🔥 تحدي » لعبة صراحة مع تاك عشوائي
❌ XO » لعبة XO الشفافة
🔢 رقم ، ارقام » لعبة أرقام عشوائية
💎 المليون » لعبة من سيربح المليون
⚡ نشط عقلك » لعبة أسئلة منوعة
—————————————
"""

    bot.reply_to(message, games_text)
