from bot import bot

@bot.message_handler(commands=['اوامر'])
def menu(message):
    text = (
        "╔══════════════════════╗\n"
        "║      ⚜️ إمبراطورية كرار ⚜️     ║\n"
        "╠══════════════════════╣\n"
        "║ ┌──────────────────┐ ║\n"
        "║ │       العاب       │ ║\n"
        "║ ├──────────────────┤ ║\n"
        "║ │       مستوى       │ ║\n"
        "║ ├──────────────────┤ ║\n"
        "║ │    الامبراطورية    │ ║\n"
        "║ └──────────────────┘ ║\n"
        "╚══════════════════════╝\n"
        "✦ اكتب الأمر المطلوب للبدء ✦"
    )
    bot.reply_to(message, text)
